04_tests/microservices/secondhand-service/evidence/hpa/20260830-181116-k6-console.log


  █ THRESHOLDS

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    server_error
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 44442   307.012482/s
    checks_succeeded...: 100.00% 44442 out of 44442
    checks_failed......: 0.00%   0 out of 44442

    ✓ secondhand HPA list: HTTP 200
    ✓ secondhand HPA list: business success
    ✓ secondhand HPA list: records returned

    CUSTOM
    business_guarded...............: 0.00%   0 out of 14814
    business_success...............: 100.00% 14814 out of 14814
    server_error...................: 0.00%   0 out of 14814

    HTTP
    http_req_duration..............: avg=148.98ms min=-599249838ns med=119.15ms max=1.11s p(90)=242.45ms p(95)=303.16ms
      { expected_response:true }...: avg=148.98ms min=-599249838ns med=119.15ms max=1.11s p(90)=242.45ms p(95)=303.16ms
    http_req_failed................: 0.00%   0 out of 14814
    http_reqs......................: 14814   102.337494/s

    EXECUTION
    iteration_duration.............: avg=151.92ms min=21.38ms      med=120.82ms max=1.11s p(90)=251.02ms p(95)=305.31ms
    iterations.....................: 14814   102.337494/s
    vus............................: 15      min=15             max=15
    vus_max........................: 15      min=15             max=15

    NETWORK
    data_received..................: 4.7 MB  32 kB/s
    data_sent......................: 1.8 MB  13 kB/s